""""
Поработайте с переменными, создайте несколько, выведите на экран,
запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
"""

answer = 42
print(f'{answer} - ответ на главный вопрос жизни, вселенной и всего такого.')

first_words = 'Hello, world!'
print(first_words)

your_answer = input('Какой твой ответ на главный вопрос жизни, вселенной и всего такого?')
print(your_answer)

your_fav_number = int(input('Какое твоё любимое число?'))
print(your_fav_number)
